#language: ru

@all
Функционал: Ипотека

  @negative
  @cucumberTest
  Сценарий: Расчет ипотеки на готове жилье
    * Загружена стартовая страница
    * Закрываем cookie баннер
    * Переход в главное меню 'Ипотека'
    * Выбираем подменю 'Ипотека на готовое жильё'
    * Заполняем поле значением
      | Стоимость недвижимости | 5 180 000 |
      | Первоначальный взнос   | 3 058 000 |
      | Срок кредита           | 30        |
    * Настраиваем дополнительные услуги
      | Страхование жизни | false |
      | Молодая семья     | true  |
    * Проверяем значение полей
      | Сумма кредита      | 2 122 000 ₽ |
      | Ежемесячный платеж | 16 017 ₽    |
      | Необходимый доход  | 20 618 ₽    |
      | Процентная ставка  | 11%         |